In [1]:
import pandas as pd

In [2]:
animals = {
    'n1' : 'Tiger',
    'n2' : 'Bear' ,
    'n3' : 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1' : 'Tiger2',
    'n2' : 'Bear2' ,
    'n3' : 'moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1' : 'Tiger3',
    'n2' : 'Bear3' ,
    'n3' : 'moose3'
}
p_animals3 = pd.Series(animals)
df = pd.DataFrame([p_animals, p_animals2, p_animals3])
df

       n1     n2      n3
0   Tiger   Bear   Moose
1  Tiger2  Bear2  moose2
2  Tiger3  Bear3  moose3

In [3]:
df.loc[1]

n1    Tiger2
n2     Bear2
n3    moose2
Name: 1, dtype: object

In [4]:
df.loc[[0,2]]

       n1     n2      n3
0   Tiger   Bear   Moose
2  Tiger3  Bear3  moose3

In [5]:
df.T

        0       1       2
n1  Tiger  Tiger2  Tiger3
n2   Bear   Bear2   Bear3
n3  Moose  moose2  moose3

In [6]:
df[['n2']]

      n2
0   Bear
1  Bear2
2  Bear3

In [7]:
df3 = df[['n1','n2']]

In [8]:
df3

       n1     n2
0   Tiger   Bear
1  Tiger2  Bear2
2  Tiger3  Bear3

In [9]:
df4 = df.copy()
df4

       n1     n2      n3
0   Tiger   Bear   Moose
1  Tiger2  Bear2  moose2
2  Tiger3  Bear3  moose3

In [10]:
df['n1'] = 1

In [11]:
df

   n1     n2      n3
0   1   Bear   Moose
1   1  Bear2  moose2
2   1  Bear3  moose3

In [12]:
df['n1'] = df['n2'] * 2

In [13]:
df

           n1     n2      n3
0    BearBear   Bear   Moose
1  Bear2Bear2  Bear2  moose2
2  Bear3Bear3  Bear3  moose3